#pragma once
#include <iostream>

namespace detail
{
#pragma pack(push, 1)
    struct position_t
    {
        char magic[1]; //0x0000
        uint64_t usersecret; //0x0001
        uint64_t time; //0x0009
        uint32_t pos_x; //0x0011
        uint32_t pos_y; //0x0015
        uint32_t pos_z; //0x0019
        uint32_t angle_x; //0x001D
        uint32_t angle_y; //0x0021
        uint32_t angle_z; //0x0025
        /*uint8_t trigger; //0x0029
        uint16_t grounded_blend; //0x002A
        uint16_t not_grounded_blend; //0x002C*/
    }; //Size: 0x002E
#pragma pack(pop)
#pragma pack(push, 1)
    struct heartbeat_t
    {
        char magic[2]; //0x0000
        uint64_t usersecret; //0x0002
        uint64_t time; //0x000A
    }; //Size: 0x0012
#pragma pack(pop)
#pragma pack(push, 1)
    struct emoji_t
    {
        char magic[1]; //0x0000
        uint64_t usersecret; //0x0001
        uint8_t emoji_id; //0x0009
    }; //Size: 0x000A
#pragma pack(pop)
#pragma pack(push, 1)
    struct login_t
    {
        char magic[1]; //0x0000
        uint64_t usersecret; //0x0001
        uint8_t username_length; //0x0009
        char username[5]; //0x000A
    }; //Size: 0x000F
#pragma pack(pop)
    static inline std::vector<std::tuple<float, float, float>> maze_runner_positions =
    {
        {207.69, 0.00, 194.43},
        {206.68, 0.00, 194.22},
        {204.49, 0.00, 193.53},
        {202.33, 0.00, 192.75},
        {200.22, 0.00, 192.02},
        {198.06, 0.00, 191.27},
        {196.06, 0.00, 190.14},
        {194.29, 0.00, 188.71},
        {192.58, 0.00, 187.23},
        {190.88, 0.00, 185.75},
        {189.18, 0.00, 184.23},
        {187.57, 0.00, 182.68},
        {185.88, 0.00, 181.11},
        {184.05, 0.00, 179.87},
        {181.90, 0.00, 179.14},
        {179.69, 0.00, 178.61},
        {177.46, 0.00, 178.41},
        {175.16, 0.00, 178.34},
        {172.91, 0.00, 178.46},
        {170.68, 0.00, 178.83},
        {168.59, 0.00, 179.89},
        {166.92, 0.00, 181.40},
        {165.70, 0.00, 183.37},
        {164.99, 0.00, 185.58},
        {164.66, 0.00, 187.74},
        {164.55, 0.00, 190.08},
        {164.69, 0.00, 192.39},
        {165.32, 0.00, 194.56},
        {166.18, 0.00, 196.59},
        {167.41, 0.00, 198.48},
        {168.97, 0.00, 200.13},
        {170.51, 0.00, 201.70},
        {171.72, 0.00, 203.58},
        {172.55, 0.00, 205.71},
        {172.78, 0.00, 208.10},
        {173.05, 0.00, 210.25},
        {173.92, 0.00, 212.37},
        {175.23, 0.00, 214.18},
        {176.82, 0.00, 215.81},
        {178.45, 0.00, 217.39},
        {180.06, 0.00, 218.93},
        {181.69, 0.00, 220.49},
        {183.27, 0.00, 222.03},
        {184.78, 0.00, 223.75},
        {185.88, 0.00, 225.71},
        {186.73, 0.00, 227.81},
        {187.31, 0.00, 229.98},
        {187.66, 0.00, 232.18},
        {187.91, 0.00, 234.46},
        {188.13, 0.00, 236.69},
        {188.34, 0.00, 238.97},
        {188.45, 0.00, 241.22},
        {188.48, 0.00, 243.46},
        {188.49, 0.00, 245.76},
        {188.48, 0.11, 247.95},
        {188.42, 0.49, 249.97},
        {188.32, 0.79, 252.07},
        {188.23, 0.89, 254.20},
        {188.12, 0.83, 256.45},
        {188.02, 0.53, 258.70},
        {187.96, 0.07, 260.93},
        {187.96, 0.00, 263.18},
        {187.97, 0.00, 265.48},
        {187.95, 0.00, 267.75},
        {187.33, 0.00, 269.91},
        {185.82, 0.00, 271.11},
        {184.46, 0.00, 271.71},
        {182.22, 0.00, 271.73},
        {179.97, 0.00, 271.65},
        {177.68, 0.00, 271.60},
        {175.46, 0.00, 271.45},
        {173.28, 0.00, 270.86},
        {171.17, 0.00, 269.93},
        {169.28, 0.00, 268.56},
        {167.78, 0.00, 266.91},
        {166.62, 0.00, 264.85},
        {166.10, 0.00, 262.72},
        {165.68, 0.00, 260.53},
        {165.21, 0.00, 258.30},
        {164.76, 0.00, 256.09},
        {164.37, 0.00, 253.85},
        {164.14, 0.00, 251.64},
        {164.10, 0.00, 249.36},
        {164.23, 0.00, 247.09},
        {164.38, 0.00, 244.82},
        {164.53, 0.00, 242.57},
        {164.68, 0.00, 240.35},
        {164.84, 0.00, 238.06},
        {164.93, 0.00, 235.78},
        {164.44, 0.00, 233.58},
        {162.98, 0.00, 231.93},
        {161.33, 0.00, 230.41},
        {160.03, 0.00, 228.45},
        {159.19, 0.00, 226.35},
        {158.52, 0.00, 224.07},
        {157.92, 0.00, 221.90},
        {156.41, 0.00, 220.22},
        {154.52, 0.00, 218.99},
        {152.53, 0.00, 217.89},
        {150.37, 0.00, 217.18},
        {148.04, 0.00, 216.85},
        {145.78, 0.00, 216.63},
        {143.56, 0.00, 216.46},
        {141.27, 0.00, 216.36},
        {139.05, 0.00, 216.32},
        {136.75, 0.00, 216.28},
        {134.49, 0.00, 216.23},
        {132.17, 0.00, 215.80},
        {130.26, 0.00, 214.60},
        {129.41, 0.00, 212.48},
        {128.96, 0.00, 210.28},
        {128.42, 0.00, 208.09},
        {127.80, 0.00, 205.89},
        {127.86, 0.00, 203.57},
        {129.43, 0.00, 201.97},
        {131.45, 0.00, 200.98},
        {133.37, 0.00, 199.77},
        {135.29, 0.00, 198.53},
        {137.23, 0.00, 197.38},
        {139.21, 0.00, 196.31},
        {141.24, 0.00, 195.24},
        {143.30, 0.00, 194.16},
        {145.31, 0.00, 193.10},
        {147.29, 0.00, 191.91},
        {148.96, 0.00, 190.42},
        {150.11, 0.00, 188.48},
        {150.66, 0.00, 186.32},
        {150.92, 0.00, 184.07},
        {151.09, 0.00, 181.79},
        {150.98, 0.00, 179.52},
        {150.79, 0.00, 177.24},
        {150.62, 0.00, 175.02},
        {150.47, 0.00, 172.73},
        {150.39, 0.00, 170.48},
        {150.43, 0.00, 168.21},
        {150.50, 0.00, 165.92},
        {150.58, 0.00, 163.66},
        {150.78, 0.00, 161.39},
        {151.50, 0.00, 159.27},
        {153.12, 0.00, 157.80},
        {155.29, 0.00, 157.33},
        {157.57, 0.00, 157.10},
        {159.80, 0.00, 157.01},
        {162.10, 0.00, 157.18},
        {164.01, 0.00, 158.30},
        {164.95, 0.00, 160.39},
        {165.97, 0.00, 162.39},
        {167.92, 0.00, 163.44},
        {170.15, 0.00, 163.75},
        {172.40, 0.00, 163.95},
        {174.68, 0.00, 163.94},
        {176.86, 0.00, 163.41},
        {178.61, 0.00, 161.90},
        {179.32, 0.00, 159.79},
        {179.57, 0.00, 157.56},
        {179.73, 0.00, 155.27},
        {179.83, 0.00, 153.05},
        {179.94, 0.00, 150.77},
        {180.07, 0.00, 148.52},
        {180.19, 0.00, 146.28},
        {180.25, 0.00, 143.96},
        {180.23, 0.00, 141.73},
        {179.93, 0.00, 139.46},
        {179.18, 0.00, 137.38},
        {177.59, 0.00, 135.80},
        {175.86, 0.00, 134.42},
        {174.54, 0.00, 132.56},
        {173.88, 0.00, 130.46},
        {173.42, 0.00, 128.18},
        {173.05, 0.00, 125.87},
        {172.50, 0.00, 123.65},
        {171.45, 0.00, 121.64},
        {169.82, 0.00, 120.15},
        {167.83, 0.00, 119.06},
        {165.68, 0.00, 118.48},
        {163.45, 0.00, 118.07},
        {161.35, 0.00, 117.37},
        {159.50, 0.00, 115.99},
        {157.80, 0.00, 114.48},
        {156.12, 0.00, 113.01},
        {154.41, 0.00, 111.45},
        {153.13, 0.00, 109.68},
        {152.12, 0.00, 107.53},
        {151.39, 0.00, 105.44},
        {150.74, 0.00, 103.26},
        {149.98, 0.00, 101.15},
        {148.76, 0.00, 99.19},
        {146.99, 0.00, 97.66},
        {144.82, 0.00, 96.92},
        {142.54, 0.00, 96.77},
        {140.32, 0.00, 96.69},
        {138.03, 0.00, 96.62},
        {135.69, 0.00, 96.54},
        {133.39, 0.00, 96.52},
        {131.06, 0.00, 96.52},
        {128.73, 0.00, 96.57},
        {126.49, 0.00, 96.74},
        {124.44, 0.00, 97.63},
        {122.74, 0.00, 99.15},
        {121.02, 0.00, 100.59},
        {119.29, 0.00, 102.03},
        {117.61, 0.00, 103.46},
        {115.99, 0.00, 105.07},
        {114.70, 0.00, 106.93},
        {114.04, 0.00, 109.14},
        {113.98, 0.00, 111.37},
        {114.04, 0.00, 113.71},
        {114.25, 0.00, 116.01},
        {114.29, 0.00, 118.20},
        {114.03, 0.00, 120.44},
        {114.21, 0.00, 122.70},
        {115.12, 0.00, 124.77},
        {117.04, 0.00, 125.83},
        {119.28, 0.00, 126.14},
        {121.60, 0.00, 126.42},
        {123.76, 0.00, 127.01},
        {125.61, 0.00, 128.19},
        {127.56, 0.00, 129.55},
        {129.48, 0.00, 130.80},
        {131.38, 0.00, 132.09},
        {132.60, 0.15, 133.38},
        {133.43, 0.15, 135.47},
        {133.79, 0.15, 137.72},
        {134.09, 0.15, 139.90},
        {134.56, 0.15, 142.14},
        {135.13, 0.00, 144.30},
        {135.53, 0.00, 146.62},
        {135.47, 0.00, 148.88},
        {135.27, 0.00, 151.14},
        {135.07, 0.00, 153.40},
        {134.87, 0.00, 155.67},
        {134.63, 0.00, 157.93},
        {134.23, 0.00, 160.12},
        {132.71, 0.00, 161.78},
        {130.76, 0.00, 162.91},
        {128.62, 0.00, 163.57},
        {126.35, 0.00, 163.88},
        {124.13, 0.00, 164.26},
        {122.32, 0.00, 165.67},
        {121.47, 0.00, 167.71},
        {120.95, 0.00, 169.92},
        {120.45, 0.00, 172.06},
        {119.68, 0.15, 173.99},
        {118.71, 0.15, 176.03},
        {117.71, 0.15, 178.05},
        {116.69, 0.15, 180.08},
        {115.63, 0.15, 182.04},
        {114.50, 0.00, 184.05},
        {113.43, 0.00, 186.06},
        {112.63, 0.00, 188.25},
        {112.09, 0.00, 190.51},
        {111.39, 0.00, 192.70},
        {109.67, 0.00, 193.99},
        {107.39, 0.00, 194.25},
        {105.14, 0.00, 194.27},
        {102.93, 0.00, 193.97},
        {101.07, 0.00, 192.64},
        {99.39, 0.00, 191.15},
        {97.72, 0.00, 189.64},
        {96.03, 0.00, 188.14},
        {93.90, 0.00, 187.46},
        {91.61, 0.00, 187.52},
        {89.37, 0.00, 187.61},
        {87.12, 0.00, 187.82},
        {85.33, 0.00, 189.05},
        {83.97, 0.00, 190.87},
        {83.51, 0.00, 193.03},
        {83.44, 0.00, 195.32},
        {83.47, 0.00, 197.60},
        {83.52, 0.00, 199.84},
        {83.43, 0.00, 202.06},
        {82.94, 0.00, 204.28},
        {81.91, 0.00, 206.28},
        {79.95, 0.00, 207.50},
        {77.77, 0.00, 208.18},
        {75.48, 0.00, 208.49},
        {73.11, 0.00, 208.53},
        {70.85, 0.00, 208.55},
        {68.60, 0.00, 208.61},
        {66.36, 0.00, 208.66},
        {64.13, 0.00, 208.68},
        {62.18, 0.00, 208.73},
        {61.78, 0.00, 208.74},
    };
    static inline bool is_running = false;
}